Catalogs/ЛБ_ОтделенияЛомбардов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_ОтделенияЛомбардов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>id_LX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Начальник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЛБ_УстановитьЛомбардыВОтделение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_УстановитьЛомбардыВОтделение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_ОтделенияЛомбардов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦентральныйЛомбард</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ЛБ_ОтделенияЛомбардов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Если Объект.Ссылка = справочники.ЛБ_ОтделенияЛомбардов.ЛомбардыВнеОтделений Тогда  
		Элементы.Ломбарды.Видимость = Ложь;
	Иначе	
		УстановитьОтборЛомбарды();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборЛомбарды() 
	ЭлементОтбора = Ломбарды.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отделение");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
КонецПроцедуры	

&НаСервере
Процедура ПослеУстановкиВОтделение(Результат, ДопПараметры) Экспорт
	Ломбарды.Отбор.Элементы.Очистить();
	УстановитьОтборЛомбарды();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВОтделение(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Необходимо сначала записать элемент справочника", Статуссообщения.Информация);
		Возврат;
	КонецЕсли;	

	Параметрыформы = Новый структура;
	ПараметрыФормы.Вставить("Отделение", Объект.Ссылка);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеУстановкиВОтделение", ЭтаФорма);
	ОткрытьФорму("Документ.ЛБ_УстановитьЛомбардыВОтделение.ФормаОбъекта", Параметрыформы, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
